Revit 2027 API
BuiltInFailures.CopyMonitorFailures.GridDeletedSameName Property
 Grid cannot be copied because grid with desired name '[Name]' already exist in a target document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridDeletedSameName { get; }
Public Shared ReadOnly Property GridDeletedSameName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridDeletedSameName {
	FailureDefinitionId^ get ();
}
static member GridDeletedSameName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyMonitorFailures Class
Autodesk.Revit.DB Namespace